CSI API ETABS v1

# cSapModelFile Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cFile File { get; }

    ReadOnly Property File As cFile
    	Get

    Dim instance As cSapModel
    Dim value As cFile

    value = instance.File

    property cFile^ File {
    	cFile^ get ();
    }

    abstract File : cFile with get

#### Property Value

Type: cFile

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com